tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"

brew "coreutils"
brew "libssh2"
brew "eza"
brew "fd"
brew "fzf"
brew "zoxide"
brew "pcre2"
brew "git"
brew "grep"
brew "gzip"
brew "hugo"
brew "starship"
brew "tree"
brew "cjbassi/ytop/ytop"
brew "clojure/tools/clojure"
brew "thefuck"
brew "elm"
brew "delta"
brew "lazygit"
brew "stow"
brew "neovim"
brew "tmux"
brew "bat"
brew "bottom"
brew "helix"
brew "lazydocker"
brew "wget"

# Optional deps for yazi. Might be useful by them selves
brew "ffmpeg"
brew "sevenzip" 
brew "jq"
brew "poppler" 
brew "ripgrep"  
brew "imagemagick" 
brew "yazi"
brew "leiningen"


#Kunde
cask "mattermost"
# Har også installer sshfs manuelt siden det ikke finnes en ARM versjon i brew 

cask "arc"
cask "jetbrains-toolbox"
cask "sublime-text"
cask "raycast"
cask "warp"
cask "zed"
cask "slack"
cask "typora"
cask "marta"
cask "font-symbols-only-nerd-font"
cask "ghostty"

mas "com.agilebits.onepassword-osx", id: 443987910
mas "marked-2-markdown-preview", id: 890031187

